package mainUtil;

import java.io.File;
import java.io.FileOutputStream;
import java.io.IOException;

import com.sun.org.apache.xml.internal.security.utils.Base64;

public class UtilShell {
	public static void main(String[] args) throws IOException {
		// File file = new File("pic/demo.txt");
		// try {
		// // 如果文件不存在，则创建
		// file.createNewFile();
		// } catch (Exception e) {
		// // 如果异常，可能是路径中的文件夹不存在。
		// file.getParentFile().mkdir();
		// try {
		// file.createNewFile();
		// } catch (Exception e2) {
		// System.out.println(e);
		// }
		// }
		// FileOutputStream fos = new FileOutputStream(file);
		// fos.write(123);
		// fos.close();
		// System.out.println("完成");
		String m = "14590986602471|15886778773|1|2017-04-26 13:37:50^10580986460431|13409309615|1|2017-04-26 13:37:35^19270985998391|15716559205|1|2017-04-26 13:36:50^15840985733851|15093781167|1|2017-04-26 13:36:30^14900984957901|15716537985|1|2017-04-26 13:35:05^13810984495381|15237592556|1|2017-04-26 13:34:29^10920983285351|15037554858|1|2017-04-26 13:32:19^14150983095661|13721874522|1|2017-04-26 13:31:59^14300982206891|13837528429|1|2017-04-26 13:30:29^16880981877661|15993550326|1|2017-04-26 13:29:59^17570981680621|15237592676|1|2017-04-26 13:29:34^19710981496091|15738168225|1|2017-04-26 13:29:19^14810980795761|15290783431|1|2017-04-26 13:28:03^18240979771041|15290751958|1|2017-04-26 13:26:23^10480979368221|13643756115|1|2017-04-26 13:25:43^14420979137591|15993530339|1|2017-04-26 13:25:23^19170978933841|18239701958|1|2017-04-26 13:25:03^18510978751331|13525900402|1|2017-04-26 13:24:43^18740978574291|15093872822|1|2017-04-26 13:24:23^17360978357261|18749622358|1|2017-04-26 13:24:03";
		String[] s = m.split("\\^");
		for (String str : s) {
			System.out.println(str);
		}
	}
}
